tests/load/load-test.yml
config:
  target: "http://backend:5000"
  phases:
    - duration: 60
      arrivalRate: 5
scenarios:
  - name: "Login and fetch actions"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "admin"
            password: "admin123"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/actions"
          headers:
            Authorization: "Bearer {{ token }}"